Revit 2027 API
ElementSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ElementSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As ElementSetIterator
public:
virtual ElementSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> ElementSetIterator
override ForwardIterator : unit -> ElementSetIterator
Return Value
ElementSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
ElementSet Class
Autodesk.Revit.DB Namespace